import UseRequestView from "src/ahooksComponents/UseRequestView"
import Table from "src/commonComponents/Table"
import {dataFormat, dataList} from "src/commonComponents/Table/types"
interface data {
  年龄: number,
  性别: string,
  出生日期: string,
  出生日期1: string,
  出生日期2: string,
  出生日期3: string
}
const row = [
  {rowIndex: 0, title: '唐浩天'},
  {rowIndex: 1, title: '猪猪猪'},
  {rowIndex: 2, title: 'ahhh'},
  {rowIndex: 3, title: 'ahhh'},
  {rowIndex: 4, title: 'ahhh'},
  {rowIndex: 5, title: 'ahhh'},
  {rowIndex: 6, title: 'ahhh'},
  {rowIndex: 7, title: 'ahhh'},
  {rowIndex: 8, title: 'ahhh'},
  {rowIndex: 9, title: 'ahhh'},
  {rowIndex: 10, title: 'ahhh'},
  {rowIndex: 11, title: 'ahhh'},
  {rowIndex: 12, title: 'ahhh'},
  {rowIndex: 13, title: 'ahhh'},
  {rowIndex: 14, title: 'ahhh'},
  {rowIndex: 15, title: 'ahhh'},
  {rowIndex: 16, title: 'ahhh'},
  {rowIndex: 17, title: 'ahhh'},
  {rowIndex: 18, title: 'ahhh'},
  {rowIndex: 19, title: 'ahhh'},
  {rowIndex: 20, title: 'ahhh'},
  {rowIndex: 21, title: 'ahhh'},
];
const jsondata = [
  {年龄: 11, 性别: '男', 星座: '双鱼', 出生日期: '2001/2/21', 出生日期1: '202222222222222222222222222222', 出生日期2: '132132', 出生日期3: '23132132'},
  {年龄: 19, 性别: '男', 星座: '双鱼', 出生日期: '2001/2/21', 出生日期1: '2022', 出生日期2: '132132', 出生日期3: '23132132'},
  {年龄: 21, 性别: '男', 星座: '双鱼', 出生日期: '2001/2/21', 出生日期1: '2022', 出生日期2: '132132', 出生日期3: '23132132'},
  {年龄: 55, 性别: '男', 星座: '双鱼', 出生日期: '2001/2/21', 出生日期1: '2022', 出生日期2: '132132', 出生日期3: '23132132'},
  {年龄: 1, 性别: '男', 星座: '双鱼', 出生日期: '2001/2/21', 出生日期1: '2022', 出生日期2: '132132', 出生日期3: '23132132'},
  {年龄: 5, 性别: '男', 星座: '双鱼', 出生日期: '2001/2/21', 出生日期1: '2022', 出生日期2: '132132', 出生日期3: '23132132'},
  {年龄: 37, 性别: '男', 星座: '双鱼', 出生日期: '2001/2/21', 出生日期1: '2022', 出生日期2: '132132', 出生日期3: '23132132'},
  {年龄: 48, 性别: '男', 星座: '双鱼', 出生日期: '2001/2/21', 出生日期1: '2022', 出生日期2: '132132', 出生日期3: '23132132'},
  {年龄: 22, 性别: '男', 星座: '双鱼', 出生日期: '2001/2/21', 出生日期1: '2022', 出生日期2: '132132', 出生日期3: '23132132'},
  {年龄: 15, 性别: '男', 星座: '双鱼', 出生日期: '2001/2/21', 出生日期1: '2022', 出生日期2: '132132', 出生日期3: '23132132'},
  {年龄: 18, 性别: '男', 星座: '双鱼', 出生日期: '2001/2/21', 出生日期1: '2022', 出生日期2: '132132', 出生日期3: '23132132'},
  {年龄: 18, 性别: '男', 星座: '双鱼', 出生日期: '2001/2/21', 出生日期1: '2022', 出生日期2: '132132', 出生日期3: '23132132'},
  {年龄: 18, 性别: '男', 星座: '双鱼', 出生日期: '2001/2/21', 出生日期1: '2022', 出生日期2: '132132', 出生日期3: '23132132'},
  {年龄: 18, 性别: '男', 星座: '双鱼', 出生日期: '2001/2/21', 出生日期1: '2022', 出生日期2: '132132', 出生日期3: '23132132'},
  {年龄: 18, 性别: '男', 星座: '双鱼', 出生日期: '2001/2/21', 出生日期1: '2022', 出生日期2: '132132', 出生日期3: '23132132'},
  {年龄: 18, 性别: '男', 星座: '双鱼', 出生日期: '2001/2/21', 出生日期1: '2022', 出生日期2: '132132', 出生日期3: '23132132'},
  {年龄: 18, 性别: '男', 星座: '双鱼', 出生日期: '2001/2/21', 出生日期1: '2022', 出生日期2: '132132', 出生日期3: '23132132'},
  {年龄: 18, 性别: '男', 星座: '双鱼', 出生日期: '2001/2/21', 出生日期1: '2022', 出生日期2: '132132', 出生日期3: '23132132'},
  {年龄: 18, 性别: '男', 星座: '双鱼', 出生日期: '2001/2/21', 出生日期1: '2022', 出生日期2: '132132', 出生日期3: '23132132'},
  {年龄: 18, 性别: '男', 星座: '双鱼', 出生日期: '2001/2/21', 出生日期1: '2022', 出生日期2: '132132', 出生日期3: '23132132'},
  {年龄: 18, 性别: '男', 星座: '双鱼', 出生日期: '2001/2/21', 出生日期1: '2022', 出生日期2: '132132', 出生日期3: '23132132'},
  {年龄: 18, 性别: '男', 星座: '双鱼', 出生日期: '2001/2/21', 出生日期1: '2022', 出生日期2: '132132', 出生日期3: '23132132'},
  {年龄: 18, 性别: '男', 星座: '双鱼', 出生日期: '2001/2/21', 出生日期1: '2022', 出生日期2: '132132', 出生日期3: '23132132'},
  {年龄: 18, 性别: '男', 星座: '双鱼', 出生日期: '2001/2/21', 出生日期1: '2022', 出生日期2: '132132', 出生日期3: '23132132'},
  {年龄: 18, 性别: '男', 星座: '双鱼', 出生日期: '2001/2/21', 出生日期1: '2022', 出生日期2: '132132', 出生日期3: '23132132'},
  {年龄: 18, 性别: '男', 星座: '双鱼', 出生日期: '2001/2/21', 出生日期1: '2022', 出生日期2: '132132', 出生日期3: '23132132'},
  {年龄: 18, 性别: '男', 星座: '双鱼', 出生日期: '2001/2/21', 出生日期1: '2022', 出生日期2: '132132', 出生日期3: '23132132'},
  {年龄: 18, 性别: '男', 星座: '双鱼', 出生日期: '2001/2/21', 出生日期1: '2022', 出生日期2: '132132', 出生日期3: '23132132'},
  {年龄: 18, 性别: '男', 星座: '双鱼', 出生日期: '2001/2/21', 出生日期1: '2022', 出生日期2: '132132', 出生日期3: '23132132'},
  {年龄: 18, 性别: '男', 星座: '双鱼', 出生日期: '2001/2/21', 出生日期1: '2022', 出生日期2: '132132', 出生日期3: '23132132'},
  {年龄: 18, 性别: '男', 星座: '双鱼', 出生日期: '2001/2/21', 出生日期1: '2022', 出生日期2: '132132', 出生日期3: '23132132'},
  {年龄: 18, 性别: '男', 星座: '双鱼', 出生日期: '2001/2/21', 出生日期1: '2022', 出生日期2: '132132', 出生日期3: '23132132'},
  {年龄: 18, 性别: '男', 星座: '双鱼', 出生日期: '2001/2/21', 出生日期1: '2022', 出生日期2: '132132', 出生日期3: '23132132'},
  {年龄: 18, 性别: '男', 星座: '双鱼', 出生日期: '2001/2/21', 出生日期1: '2022', 出生日期2: '132132', 出生日期3: '23132132'},
  {年龄: 18, 性别: '男', 星座: '双鱼', 出生日期: '2001/2/21', 出生日期1: '2022', 出生日期2: '132132', 出生日期3: '23132132'},
  {年龄: 18, 性别: '男', 星座: '双鱼', 出生日期: '2001/2/21', 出生日期1: '2022', 出生日期2: '132132', 出生日期3: '23132132'},
  {年龄: 18, 性别: '男', 星座: '双鱼', 出生日期: '2001/2/21', 出生日期1: '2022', 出生日期2: '132132', 出生日期3: '23132132'},
  {年龄: 18, 性别: '男', 星座: '双鱼', 出生日期: '2001/2/21', 出生日期1: '2022', 出生日期2: '132132', 出生日期3: '23132132'},
  {年龄: 18, 性别: '男', 星座: '双鱼', 出生日期: '2001/2/21', 出生日期1: '2022', 出生日期2: '132132', 出生日期3: '23132132'},
  {年龄: 18, 性别: '男', 星座: '双鱼', 出生日期: '2001/2/21', 出生日期1: '2022', 出生日期2: '132132', 出生日期3: '23132132'},
  {年龄: 18, 性别: '男', 星座: '双鱼', 出生日期: '2001/2/21', 出生日期1: '2022', 出生日期2: '132132', 出生日期3: '23132132'},
  {年龄: 18, 性别: '男', 星座: '双鱼', 出生日期: '2001/2/21', 出生日期1: '2022', 出生日期2: '132132', 出生日期3: '23132132'},
];
const coulmn = [
  {
    sortable: true,
    coulmnIndex: 0,
    title: '年龄',
    sortFunc:
      function (pre: data, next: data): number {
        return pre['年龄'] - next['年龄']
      }
  },
  {sortable: false, coulmnIndex: 1, title: '性别'},
  {sortable: false, coulmnIndex: 2, title: '星座'},
  {sortable: false, coulmnIndex: 3, title: '出生日期'},
  {sortable: false, coulmnIndex: 4, title: '出生日期1'},
  {sortable: false, coulmnIndex: 5, title: '出生日期2'},
  {sortable: false, coulmnIndex: 6, title: '出生日期3'},
]


export default () => {
  return (
    <div>
      <UseRequestView />
      <br></br>
      <div style={{width: '500px', backgroundColor: '#f0f0f0', height: '400px'}}>
        <Table row={row} coulmn={coulmn} dataList={jsondata} />
      </div>
    </div >

  )
}